In [2]:
import sqlite3
conn=sqlite3.connect('school_database.sqlite')
cur=conn.cursor()
print("Open datbase successfully")

Open datbase successfully

In [3]:
cur.execute('''CREATE TABLE SCHOOL(ID INT PRIMARY KEY NOT NULL,NAME TEXT NOT NULL,AGE INT NOT NULL,ADDRESS CHAR(50),MARKS INT)''')

In [4]:
cur.execute('''INSERT INTO SCHOOL(ID,NAME,AGE,ADDRESS,MARKS)
VALUES(1,'RIYA',20,'HUBLI',88);''')
conn.commit()

In [5]:
cur.execute('''INSERT INTO SCHOOL(ID,NAME,AGE,ADDRESS,MARKS)
VALUES(2,'RAJ',20,'BANGLORE',75);''')
cur.execute('''INSERT INTO SCHOOL(ID,NAME,AGE,ADDRESS,MARKS)
VALUES(3,'SANA',21,'BOMBAY',84);''')
cur.execute('''INSERT INTO SCHOOL(ID,NAME,AGE,ADDRESS,MARKS)
VALUES(4,'NIDHI',21,'HUBLI',95);''')
cur.execute('''INSERT INTO SCHOOL(ID,NAME,AGE,ADDRESS,MARKS)
VALUES(5,'ZAREEN',20,'GULBARGA',93);''')
cur.execute('''INSERT INTO SCHOOL(ID,NAME,AGE,ADDRESS,MARKS)
VALUES(6,'SUMA',20,'HAVERI',90);''')
cur.execute('''INSERT INTO SCHOOL(ID,NAME,AGE,ADDRESS,MARKS)
VALUES(7,'RAHUL',21,'RAICHUR',66);''')
cur.execute('''INSERT INTO SCHOOL(ID,NAME,AGE,ADDRESS,MARKS)
VALUES(8,'MEGHA',20,'DHARWAD',73);''')
cur.execute('''INSERT INTO SCHOOL(ID,NAME,AGE,ADDRESS,MARKS)
VALUES(9,'SUGA',25,'SEOUL',94);''')
cur.execute('''INSERT INTO SCHOOL(ID,NAME,AGE,ADDRESS,MARKS)
VALUES(10,'KIARA',22,'HUBLI',97);''')
conn.commit()

In [6]:
cur.execute("SELECT * FROM SCHOOL")
result=cur.fetchall()
print(result)

[(1, 'RIYA', 20, 'HUBLI', 88), (2, 'RAJ', 20, 'BANGLORE', 75), (3, 'SANA', 21, 'BOMBAY', 84), (4, 'NIDHI', 21, 'HUBLI', 95), (5, 'ZAREEN', 20, 'GULBARGA', 93), (6, 'SUMA', 20, 'HAVERI', 90), (7, 'RAHUL', 21, 'RAICHUR', 66), (8, 'MEGHA', 20, 'DHARWAD', 73), (9, 'SUGA', 25, 'SEOUL', 94), (10, 'KIARA', 22, 'HUBLI', 97)]

In [7]:
for row in cur.execute("SELECT ID,NAME,AGE,ADDRESS,MARKS FROM SCHOOL"):
    print('ID',row[0])
    print('NAME',row[1])
    print('AGE',row[2])
    print('ADDRESS',row[3])
    print('MARKS',row[4])

ID 1
NAME RIYA
AGE 20
ADDRESS HUBLI
MARKS 88
ID 2
NAME RAJ
AGE 20
ADDRESS BANGLORE
MARKS 75
ID 3
NAME SANA
AGE 21
ADDRESS BOMBAY
MARKS 84
ID 4
NAME NIDHI
AGE 21
ADDRESS HUBLI
MARKS 95
ID 5
NAME ZAREEN
AGE 20
ADDRESS GULBARGA
MARKS 93
ID 6
NAME SUMA
AGE 20
ADDRESS HAVERI
MARKS 90
ID 7
NAME RAHUL
AGE 21
ADDRESS RAICHUR
MARKS 66
ID 8
NAME MEGHA
AGE 20
ADDRESS DHARWAD
MARKS 73
ID 9
NAME SUGA
AGE 25
ADDRESS SEOUL
MARKS 94
ID 10
NAME KIARA
AGE 22
ADDRESS HUBLI
MARKS 97

In [8]:
cur.execute("UPDATE SCHOOL SET AGE=19 WHERE ID=1")
conn.commit()

In [9]:
cur.execute("DELETE FROM SCHOOL WHERE ID=10")
conn.commit()